app/controllers/documents_controller.rb

  def index
    @documents = Document.all
---
SELECT `documents`.* FROM `documents`

  def doc
    @doc = Document.all
    @doc = @doc.where(:document_attached_content_type => "application/vnd.openxmlformats-officedocument.wordprocessingml.document")
---
SELECT `documents`.* FROM `documents` WHERE `documents`.`document_attached_content_type` = 'image/jpeg'

  def create
    @document = Document.new( document_params )
    @document.user_id=current_user.id

    respond_to do |format|
      if @document.save
---
INSERT INTO `documents` (`user_id`, `document_attached_file_name`, `document_attached_content_type`, `document_attached_file_size`, `document_attached_updated_at`, `created_at`, `updated_at`, `subject`) VALUES (1, 'lexical_Analyzer.pptx', 'application/zip', 5718710, '2019-03-21 13:23:24', '2019-03-21 13:23:24', '2019-03-21 13:23:24', 'ppt')

  def update
    respond_to do |format|
      if @document.update(document_params)
---
UPDATE `documents` SET `document_attached_file_name` = '1.jpg', `document_attached_file_size` = 7930584, `document_attached_updated_at` = '2019-03-07 14:18:53', `updated_at` = '2019-03-07 14:19:00' WHERE `documents`.`id` = 8

  def destroy
    @document.destroy
---
DELETE FROM `documents` WHERE `documents`.`id` = 9

    def set_document
      @document = Document.find(params[:id])
---
SELECT  `documents`.* FROM `documents` WHERE `documents`.`id` = 3 LIMIT 1