app/controllers/videos_controller.rb

SELECT `videos`.* FROM `videos`
---
  def index
    @videos = Video.all

INSERT INTO `videos` (`title`, `link`, `created_at`, `updated_at`, `subject`) VALUES ('Time And Work', 'https://www.youtube.com/embed/5VrYzI8DXFY', '2019-03-20 20:56:39', '2019-03-20 20:56:39', 'asdf')
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save

SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 1 LIMIT 1
---
    def set_video
      @video = Video.find(params[:id])